app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if @songs.nil?
        redirect_to artists_url, flash[:alert] = "Artist not found."
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]